class Urls:
    BASE_URL = "https://qa-scooter.praktikum-services.ru/"
    ORDER_URL = "https://qa-scooter.praktikum-services.ru/order"
    DZEN_URL = "https://dzen.ru/"


class Questions:
    PRICE_QUESTION_TEXT = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    FEW_SCOOTERS_QUESTION_TEXT = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, ' \
                                 'можете просто сделать несколько заказов — один за другим.'
    RENT_TIME_QUESTION_TEXT = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. ' \
                              'Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы ' \
                              'привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    SCOOTER_TODAY_QUESTION_TEXT = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    EXTEND_TIME_QUESTION_TEXT = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по ' \
                                'красивому номеру 1010.'
    CHARGER_QUESTION_TEXT = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если ' \
                            'будете кататься без передышек и во сне. Зарядка не понадобится.'
    CANCEL_ORDER_QUESTION_TEXT = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не ' \
                                 'попросим. Все же свои.'
    DISTANCE_QUESTION_TEXT = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'



